---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.AirSystemData
source: html/4a7c39a1-cd35-4828-97b7-f70cbd3fdab8.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData

Represents the data and parameter of analytical air system.

## Syntax (C#)
```csharp
public class AirSystemData : IDisposable
```